# Data Transformation

In [1]:
import pandas as pd

pd.__version__

'2.1.0'

In [2]:
# prepare the data
url = "https://raw.githubusercontent.com/byuidatascience/data4python4ds/master/data-raw/flights/flights.csv"
flights = pd.read_csv(url)

In [3]:
flights.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01T10:00:00Z
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01T10:00:00Z
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01T10:00:00Z
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01T10:00:00Z
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01T11:00:00Z

In [4]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 336776 entries, 0 to 336775
Data columns (total 19 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   year            336776 non-null  int64
 1   month           336776 non-null  int64
 2   day             336776 non-null  int64
 3   dep_time        328521 non-null  float64
 4   sched_dep_time  336776 non-null  int64
 5   dep_delay       328521 non-null  float64
 6   arr_time        328063 non-null  float64
 7   sched_arr_time  336776 non-null  int64
 8   arr_delay       327346 non-null  float64
 9   carrier         336776 non-null  object
 10  flight          336776 non-null  int64
 11  tailnum         334264 non-null  object
 12  origin          336776 non-null  object
 13  dest            336776 non-null  object
 14  air_time        327346 non-null  float64
 15  distance        336776 non-null  int64
 16  hour            336776 non-null  int64
 17  minute          336776 non-null  int64
 18  time_hour       336776 non-null  object
dtypes: float64(5), int64(9), object(5)
memory usage: 48.8+ MB

In [5]:
flights["time_hour"]

0         2013-01-01T10:00:00Z
1         2013-01-01T10:00:00Z
2         2013-01-01T10:00:00Z
3         2013-01-01T10:00:00Z
4         2013-01-01T11:00:00Z
                  ...
336771    2013-09-30T18:00:00Z
336772    2013-10-01T02:00:00Z
336773    2013-09-30T16:00:00Z
336774    2013-09-30T15:00:00Z
336775    2013-09-30T12:00:00Z
Name: time_hour, Length: 336776, dtype: object

In [6]:
flights["time_hour"] = pd.to_datetime(flights["time_hour"], format="%Y-%m-%dT%H:%M:%SZ")
flights["time_hour"]

0        2013-01-01 10:00:00
1        2013-01-01 10:00:00
2        2013-01-01 10:00:00
3        2013-01-01 10:00:00
4        2013-01-01 11:00:00
                 ...
336771   2013-09-30 18:00:00
336772   2013-10-01 02:00:00
336773   2013-09-30 16:00:00
336774   2013-09-30 15:00:00
336775   2013-09-30 12:00:00
Name: time_hour, Length: 336776, dtype: datetime64[ns]

## Pandas Basic

In [7]:
df = pd.DataFrame(
    data={
        "col0": [0, 0, 0, 0],
        "col1": [0, 0, 0, 0],
        "col2": [0, 0, 0, 0],
        "col3": ["a", "b", "b", "a"],
        "col4": ["alpha", "gamma", "gamma", "gamma"],
    },
    index=["row" + str(i) for i in range(4)],
)
df.head()

      col0  col1  col2 col3   col4
row0     0     0     0    a  alpha
row1     0     0     0    b  gamma
row2     0     0     0    b  gamma
row3     0     0     0    a  gamma

In [8]:
"""
Chain query with 4 key operations:
- manipulating rows
- manipulating the index
- manipulating columns
- applying statistics
"""
flights.query("dest == 'IAH'").groupby(["year", "month", "day", "origin", "distance"])[["arr_delay"]].mean()

                                arr_delay
year month day origin distance
2013 1     1   EWR    1400      15.181818
               LGA    1416      21.111111
           2   EWR    1400      11.363636
               LGA    1416       1.666667
           3   EWR    1400      13.700000
...                                   ...
     12    30  JFK    1417      33.000000
               LGA    1416      13.571429
           31  EWR    1400       3.875000
               JFK    1417       2.000000
               LGA    1416     -17.833333

[1004 rows x 1 columns]

## Manipulating Rows

In [9]:
import numpy as np

df = pd.DataFrame(
    data=np.reshape(range(36), (6, 6)),
    index=["a", "b", "c", "d", "e", "f"],
    columns=["col" + str(i) for i in range(6)],
    dtype=float,
)
df["col6"] = ["apple", "orange", "pineapple", "mango", "kiwi", "lemon"]
df

   col0  col1  col2  col3  col4  col5       col6
a   0.0   1.0   2.0   3.0   4.0   5.0      apple
b   6.0   7.0   8.0   9.0  10.0  11.0     orange
c  12.0  13.0  14.0  15.0  16.0  17.0  pineapple
d  18.0  19.0  20.0  21.0  22.0  23.0      mango
e  24.0  25.0  26.0  27.0  28.0  29.0       kiwi
f  30.0  31.0  32.0  33.0  34.0  35.0      lemon

In [10]:
# accessing rows
df.loc[["a", "b"]]

   col0  col1  col2  col3  col4  col5    col6
a   0.0   1.0   2.0   3.0   4.0   5.0   apple
b   6.0   7.0   8.0   9.0  10.0  11.0  orange

In [11]:
# or like this
df.iloc[0]

col0      0.0
col1      1.0
col2      2.0
col3      3.0
col4      4.0
col5      5.0
col6    apple
Name: a, dtype: object

In [12]:
df.iloc[[0, 2]]

   col0  col1  col2  col3  col4  col5       col6
a   0.0   1.0   2.0   3.0   4.0   5.0      apple
c  12.0  13.0  14.0  15.0  16.0  17.0  pineapple

In [13]:
# filtering rows
df.query("col6 == 'kiwi' or col6 == 'pineapple'")

   col0  col1  col2  col3  col4  col5       col6
c  12.0  13.0  14.0  15.0  16.0  17.0  pineapple
e  24.0  25.0  26.0  27.0  28.0  29.0       kiwi

In [14]:
df.query("col0 > 6")

   col0  col1  col2  col3  col4  col5       col6
c  12.0  13.0  14.0  15.0  16.0  17.0  pineapple
d  18.0  19.0  20.0  21.0  22.0  23.0      mango
e  24.0  25.0  26.0  27.0  28.0  29.0       kiwi
f  30.0  31.0  32.0  33.0  34.0  35.0      lemon

In [15]:
# Flights that departed on January 1
flights.query("month == 1 and day == 1")

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 10:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 10:00:00
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 10:00:00
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 10:00:00
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 11:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
837,2013,1,1,2356.0,2359,-3.0,425.0,437,-12.0,B6,727,N588JB,JFK,BQN,186.0,1576,23,59,2013-01-02 04:00:00
838,2013,1,1,NaN,1630,NaN,NaN,1815,NaN,EV,4308,N18120,EWR,RDU,NaN,416,16,30,2013-01-01 21:00:00
839,2013,1,1,NaN,1935,NaN,NaN,2240,NaN,AA,791,N3EHAA,LGA,DFW,NaN,1389,19,35,2013-01-02 00:00:00
840,2013,1,1,NaN,1500,NaN,NaN,1825,NaN,AA,1925,N3EVAA,LGA,MIA,NaN,1096,15,0,2013-01-01 20:00:00
841,2013,1,1,NaN,600,NaN,NaN,901,NaN,B6,125,N618JB,JFK,FLL,NaN,1069,6,0,2013-01-01 11:00:00

In [16]:
# Re-arranging rows
flights.sort_values(["year", "month", "day", "dep_time"])

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 10:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 10:00:00
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 10:00:00
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 10:00:00
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 11:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
111291,2013,12,31,NaN,705,NaN,NaN,931,NaN,UA,1729,NaN,EWR,DEN,NaN,1605,7,5,2013-12-31 12:00:00
111292,2013,12,31,NaN,825,NaN,NaN,1029,NaN,US,1831,NaN,JFK,CLT,NaN,541,8,25,2013-12-31 13:00:00
111293,2013,12,31,NaN,1615,NaN,NaN,1800,NaN,MQ,3301,N844MQ,LGA,RDU,NaN,431,16,15,2013-12-31 21:00:00
111294,2013,12,31,NaN,600,NaN,NaN,735,NaN,UA,219,NaN,EWR,ORD,NaN,719,6,0,2013-12-31 11:00:00
111295,2013,12,31,NaN,830,NaN,NaN,1154,NaN,UA,443,NaN,JFK,LAX,NaN,2475,8,30,2013-12-31 13:00:00

In [17]:
# or with argument
flights.sort_values("dep_delay", ascending=False)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
7072,2013,1,9,641.0,900,1301.0,1242.0,1530,1272.0,HA,51,N384HA,JFK,HNL,640.0,4983,9,0,2013-01-09 14:00:00
235778,2013,6,15,1432.0,1935,1137.0,1607.0,2120,1127.0,MQ,3535,N504MQ,JFK,CMH,74.0,483,19,35,2013-06-15 23:00:00
8239,2013,1,10,1121.0,1635,1126.0,1239.0,1810,1109.0,MQ,3695,N517MQ,EWR,ORD,111.0,719,16,35,2013-01-10 21:00:00
327043,2013,9,20,1139.0,1845,1014.0,1457.0,2210,1007.0,AA,177,N338AA,JFK,SFO,354.0,2586,18,45,2013-09-20 22:00:00
270376,2013,7,22,845.0,1600,1005.0,1044.0,1815,989.0,MQ,3075,N665MQ,JFK,CVG,96.0,589,16,0,2013-07-22 20:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
336771,2013,9,30,NaN,1455,NaN,NaN,1634,NaN,9E,3393,NaN,JFK,DCA,NaN,213,14,55,2013-09-30 18:00:00
336772,2013,9,30,NaN,2200,NaN,NaN,2312,NaN,9E,3525,NaN,LGA,SYR,NaN,198,22,0,2013-10-01 02:00:00
336773,2013,9,30,NaN,1210,NaN,NaN,1330,NaN,MQ,3461,N535MQ,LGA,BNA,NaN,764,12,10,2013-09-30 16:00:00
336774,2013,9,30,NaN,1159,NaN,NaN,1344,NaN,MQ,3572,N511MQ,LGA,CLE,NaN,419,11,59,2013-09-30 15:00:00
336775,2013,9,30,NaN,840,NaN,NaN,1020,NaN,MQ,3531,N839MQ,LGA,RDU,NaN,431,8,40,2013-09-30 12:00:00

In [18]:
# combine
(flights.query("dep_delay <=10 and dep_delay>=-10")
.sort_values("arr_delay", ascending=False)
.iloc[[0, 1, 2, 3]]
)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
55985,2013,11,1,658.0,700,-2.0,1329.0,1015,194.0,VX,399,N629VA,JFK,LAX,336.0,2475,7,0,2013-11-01 11:00:00
181270,2013,4,18,558.0,600,-2.0,1149.0,850,179.0,AA,707,N3EXAA,LGA,DFW,234.0,1389,6,0,2013-04-18 10:00:00
256340,2013,7,7,1659.0,1700,-1.0,2050.0,1823,147.0,US,2183,N948UW,LGA,DCA,64.0,214,17,0,2013-07-07 21:00:00
325749,2013,9,19,648.0,641,7.0,1035.0,810,145.0,UA,1262,N17244,EWR,ORD,169.0,719,6,41,2013-09-19 10:00:00

## Manipulating Columns
访问行：df.iloc[i]
访问列：df.iloc[:, j]

In [19]:
# creating new columns
df["new_column0"] = 5
df

   col0  col1  col2  col3  col4  col5       col6  new_column0
a   0.0   1.0   2.0   3.0   4.0   5.0      apple            5
b   6.0   7.0   8.0   9.0  10.0  11.0     orange            5
c  12.0  13.0  14.0  15.0  16.0  17.0  pineapple            5
d  18.0  19.0  20.0  21.0  22.0  23.0      mango            5
e  24.0  25.0  26.0  27.0  28.0  29.0       kiwi            5
f  30.0  31.0  32.0  33.0  34.0  35.0      lemon            5

In [20]:
df["new_column0"] = [0, 1, 2, 3, 4, 5]
df

   col0  col1  col2  col3  col4  col5       col6  new_column0
a   0.0   1.0   2.0   3.0   4.0   5.0      apple            0
b   6.0   7.0   8.0   9.0  10.0  11.0     orange            1
c  12.0  13.0  14.0  15.0  16.0  17.0  pineapple            2
d  18.0  19.0  20.0  21.0  22.0  23.0      mango            3
e  24.0  25.0  26.0  27.0  28.0  29.0       kiwi            4
f  30.0  31.0  32.0  33.0  34.0  35.0      lemon            5

In [21]:
df[["new_column1", "new_column2"]] = [5, 6]
df

,col0,col1,col2,col3,col4,col5,col6,new_column0,new_column1,new_column2
a,0.0,1.0,2.0,3.0,4.0,5.0,apple,0,5,6
b,6.0,7.0,8.0,9.0,10.0,11.0,orange,1,5,6
c,12.0,13.0,14.0,15.0,16.0,17.0,pineapple,2,5,6
d,18.0,19.0,20.0,21.0,22.0,23.0,mango,3,5,6
e,24.0,25.0,26.0,27.0,28.0,29.0,kiwi,4,5,6
f,30.0,31.0,32.0,33.0,34.0,35.0,lemon,5,5,6

In [22]:
df["new_column3"] = df["col0"] - df["new_column0"]
df

,col0,col1,col2,col3,col4,col5,col6,new_column0,new_column1,new_column2,new_column3
a,0.0,1.0,2.0,3.0,4.0,5.0,apple,0,5,6,0.0
b,6.0,7.0,8.0,9.0,10.0,11.0,orange,1,5,6,5.0
c,12.0,13.0,14.0,15.0,16.0,17.0,pineapple,2,5,6,10.0
d,18.0,19.0,20.0,21.0,22.0,23.0,mango,3,5,6,15.0
e,24.0,25.0,26.0,27.0,28.0,29.0,kiwi,4,5,6,20.0
f,30.0,31.0,32.0,33.0,34.0,35.0,lemon,5,5,6,25.0

In [23]:
(
    flights.assign(
        gain=lambda row: row["dep_delay"] - row["arr_delay"],
        speed=lambda row: row["distance"] / row["air_time"] * 60,
    )
)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,...,tailnum,origin,dest,air_time,distance,hour,minute,time_hour,gain,speed
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,...,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 10:00:00,-9.0,370.044053
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,...,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 10:00:00,-16.0,374.273128
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,...,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 10:00:00,-31.0,408.375000
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,...,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 10:00:00,17.0,516.721311
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,...,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 11:00:00,19.0,394.137931
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
336771,2013,9,30,NaN,1455,NaN,NaN,1634,NaN,9E,...,NaN,JFK,DCA,NaN,213,14,55,2013-09-30 18:00:00,NaN,NaN
336772,2013,9,30,NaN,2200,NaN,NaN,2312,NaN,9E,...,NaN,LGA,SYR,NaN,198,22,0,2013-10-01 02:00:00,NaN,NaN
336773,2013,9,30,NaN,1210,NaN,NaN,1330,NaN,MQ,...,N535MQ,LGA,BNA,NaN,764,12,10,2013-09-30 16:00:00,NaN,NaN
336774,2013,9,30,NaN,1159,NaN,NaN,1344,NaN,MQ,...,N511MQ,LGA,CLE,NaN,419,11,59,2013-09-30 15:00:00,NaN,NaN
336775,2013,9,30,NaN,840,NaN,NaN,1020,NaN,MQ,...,N839MQ,LGA,RDU,NaN,431,8,40,2013-09-30 12:00:00,NaN,NaN

## Accessing Columns

In [24]:
df["col0"]

a     0.0
b     6.0
c    12.0
d    18.0
e    24.0
f    30.0
Name: col0, dtype: float64

In [25]:
# multiple columns
df[["col0", "new_column0", "col2"]]

   col0  new_column0  col2
a   0.0            0   2.0
b   6.0            1   8.0
c  12.0            2  14.0
d  18.0            3  20.0
e  24.0            4  26.0
f  30.0            5  32.0

In [26]:
# particular columns
df.loc[["a", "b"], ["col0", "new_column0", "col2"]]

   col0  new_column0  col2
a   0.0            0   2.0
b   6.0            1   8.0

In [27]:
df.iloc[:, [0, 1]]

   col0  col1
a   0.0   1.0
b   6.0   7.0
c  12.0  13.0
d  18.0  19.0
e  24.0  25.0
f  30.0  31.0

In [28]:
# use types
flights.select_dtypes("int64")

,year,month,day,sched_dep_time,sched_arr_time,flight,distance,hour,minute
0,2013,1,1,515,819,1545,1400,5,15
1,2013,1,1,529,830,1714,1416,5,29
2,2013,1,1,540,850,1141,1089,5,40
3,2013,1,1,545,1022,725,1576,5,45
4,2013,1,1,600,837,461,762,6,0
...,...,...,...,...,...,...,...,...,...
336771,2013,9,30,1455,1634,3393,213,14,55
336772,2013,9,30,2200,2312,3525,198,22,0
336773,2013,9,30,1210,1330,3461,764,12,10
336774,2013,9,30,1159,1344,3572,419,11,59
336775,2013,9,30,840,1020,3531,431,8,40

In [29]:
print("The selection from the data frame:")
df.loc[:, df.columns.str.startswith("new")]

The selection from the data frame:

   new_column0  new_column1  new_column2  new_column3
a            0            5            6          0.0
b            1            5            6          5.0
c            2            5            6         10.0
d            3            5            6         15.0
e            4            5            6         20.0
f            5            5            6         25.0

## Renaming Columns

In [30]:
print(df)
df.rename(columns={"col3": "letters", "col4": "names", "col6": "fruit"})

   col0  col1  col2  col3  col4  col5       col6  new_column0  new_column1  \
a   0.0   1.0   2.0   3.0   4.0   5.0      apple            0            5
b   6.0   7.0   8.0   9.0  10.0  11.0     orange            1            5
c  12.0  13.0  14.0  15.0  16.0  17.0  pineapple            2            5
d  18.0  19.0  20.0  21.0  22.0  23.0      mango            3            5
e  24.0  25.0  26.0  27.0  28.0  29.0       kiwi            4            5
f  30.0  31.0  32.0  33.0  34.0  35.0      lemon            5            5

   new_column2  new_column3
a            6          0.0
b            6          5.0
c            6         10.0
d            6         15.0
e            6         20.0
f            6         25.0

,col0,col1,col2,letters,names,col5,fruit,new_column0,new_column1,new_column2,new_column3
a,0.0,1.0,2.0,3.0,4.0,5.0,apple,0,5,6,0.0
b,6.0,7.0,8.0,9.0,10.0,11.0,orange,1,5,6,5.0
c,12.0,13.0,14.0,15.0,16.0,17.0,pineapple,2,5,6,10.0
d,18.0,19.0,20.0,21.0,22.0,23.0,mango,3,5,6,15.0
e,24.0,25.0,26.0,27.0,28.0,29.0,kiwi,4,5,6,20.0
f,30.0,31.0,32.0,33.0,34.0,35.0,lemon,5,5,6,25.0

In [31]:
df.columns = df.columns.str.capitalize()
df

,Col0,Col1,Col2,Col3,Col4,Col5,Col6,New_column0,New_column1,New_column2,New_column3
a,0.0,1.0,2.0,3.0,4.0,5.0,apple,0,5,6,0.0
b,6.0,7.0,8.0,9.0,10.0,11.0,orange,1,5,6,5.0
c,12.0,13.0,14.0,15.0,16.0,17.0,pineapple,2,5,6,10.0
d,18.0,19.0,20.0,21.0,22.0,23.0,mango,3,5,6,15.0
e,24.0,25.0,26.0,27.0,28.0,29.0,kiwi,4,5,6,20.0
f,30.0,31.0,32.0,33.0,34.0,35.0,lemon,5,5,6,25.0

In [32]:
df.columns.str.replace("Col", "Original_column")

Index(['Original_column0', 'Original_column1', 'Original_column2',
       'Original_column3', 'Original_column4', 'Original_column5',
       'Original_column6', 'New_column0', 'New_column1', 'New_column2',
       'New_column3'],
      dtype='object')

## Re-ordering Columns

In [33]:
df = pd.DataFrame(
    data=np.reshape(range(36), (6, 6)),
    index=["a", "b", "c", "d", "e", "f"],
    columns=["col" + str(i) for i in range(6)],
    dtype=float,
)
df

   col0  col1  col2  col3  col4  col5
a   0.0   1.0   2.0   3.0   4.0   5.0
b   6.0   7.0   8.0   9.0  10.0  11.0
c  12.0  13.0  14.0  15.0  16.0  17.0
d  18.0  19.0  20.0  21.0  22.0  23.0
e  24.0  25.0  26.0  27.0  28.0  29.0
f  30.0  31.0  32.0  33.0  34.0  35.0

In [37]:
df = df[["col5", "col3", "col1", "col4", "col2", "col0"]]
df

   col5  col3  col1  col4  col2  col0
a   5.0   3.0   1.0   4.0   2.0   0.0
b  11.0   9.0   7.0  10.0   8.0   6.0
c  17.0  15.0  13.0  16.0  14.0  12.0
d  23.0  21.0  19.0  22.0  20.0  18.0
e  29.0  27.0  25.0  28.0  26.0  24.0
f  35.0  33.0  31.0  34.0  32.0  30.0

In [38]:
df.reindex(sorted(df.columns), axis=1)

   col0  col1  col2  col3  col4  col5
a   0.0   1.0   2.0   3.0   4.0   5.0
b   6.0   7.0   8.0   9.0  10.0  11.0
c  12.0  13.0  14.0  15.0  16.0  17.0
d  18.0  19.0  20.0  21.0  22.0  23.0
e  24.0  25.0  26.0  27.0  28.0  29.0
f  30.0  31.0  32.0  33.0  34.0  35.0

# Grouping

In [39]:
(
    flights.groupby(["month"]).agg(
        mean_delay=("dep_delay", "mean"),
        count_flights=("dep_delay", "count"),
    )
)

       mean_delay  count_flights
month
1       10.036665          26483
2       10.816843          23690
3       13.227076          27973
4       13.938038          27662
5       12.986859          28233
6       20.846332          27234
7       21.727787          28485
8       12.611040          28841
9        6.722476          27122
10       6.243988          28653
11       5.435362          27035
12      16.576688          27110

In [40]:
month_year_delay = flights.groupby(["month", "year"]).agg(
    mean_delay=("dep_delay", "mean"),
    count_flights=("dep_delay", "count"),
)
month_year_delay

            mean_delay  count_flights
month year
1     2013   10.036665          26483
2     2013   10.816843          23690
3     2013   13.227076          27973
4     2013   13.938038          27662
5     2013   12.986859          28233
6     2013   20.846332          27234
7     2013   21.727787          28485
8     2013   12.611040          28841
9     2013    6.722476          27122
10    2013    6.243988          28653
11    2013    5.435362          27035
12    2013   16.576688          27110

In [41]:
month_year_delay.reset_index()

    month  year  mean_delay  count_flights
0       1  2013   10.036665          26483
1       2  2013   10.816843          23690
2       3  2013   13.227076          27973
3       4  2013   13.938038          27662
4       5  2013   12.986859          28233
5       6  2013   20.846332          27234
6       7  2013   21.727787          28485
7       8  2013   12.611040          28841
8       9  2013    6.722476          27122
9      10  2013    6.243988          28653
10     11  2013    5.435362          27035
11     12  2013   16.576688          27110

In [42]:
month_year_delay.reset_index(1)

       year  mean_delay  count_flights
month
1      2013   10.036665          26483
2      2013   10.816843          23690
3      2013   13.227076          27973
4      2013   13.938038          27662
5      2013   12.986859          28233
6      2013   20.846332          27234
7      2013   21.727787          28485
8      2013   12.611040          28841
9      2013    6.722476          27122
10     2013    6.243988          28653
11     2013    5.435362          27035
12     2013   16.576688          27110